In [4]:
import pandas as pd

In [7]:
data={"a":[1,2,3,4],"b":[4,5,6,7],"c":["asma","saba","saad","umaira"]}

In [30]:
df=pd.DataFrame(data)

In [31]:
df

   a  b       c
0  1  4    asma
1  2  5    saba
2  3  6    saad
3  4  7  umaira

In [32]:
df.set_index('a',inplace=True)

In [33]:
df

   b       c
a
1  4    asma
2  5    saba
3  6    saad
4  7  umaira

In [36]:
df=df.reset_index()

In [37]:
df

   a  b       c
0  1  4    asma
1  2  5    saba
2  3  6    saad
3  4  7  umaira

In [39]:
data={"a":[1,2,3,4],"b":[4,5,6,7],"c":["asma","saba","saad","umaira"]}
df1=pd.DataFrame(data,index=['a','b','c','d'])

In [40]:
df1

   a  b       c
a  1  4    asma
b  2  5    saba
c  3  6    saad
d  4  7  umaira

In [41]:
df1.reindex(['d','c','a','b'])

   a  b       c
d  4  7  umaira
c  3  6    saad
a  1  4    asma
b  2  5    saba

In [48]:
df1

   a  b       c
a  1  4    asma
b  2  5    saba
c  3  6    saad
d  4  7  umaira

In [43]:
df1.iterrows

<bound method DataFrame.iterrows of    a  b       c
a  1  4    asma
b  2  5    saba
c  3  6    saad
d  4  7  umaira>


#### ***use row index***

In [45]:
for i,j in df1.iterrows():
    print(i,j)

a a       1
b       4
c    asma
Name: a, dtype: object
b a       2
b       5
c    saba
Name: b, dtype: object
c a       3
b       6
c    saad
Name: c, dtype: object
d a         4
b         7
c    umaira
Name: d, dtype: object

#### ***use column index***

In [52]:
for i,j in df1.items():
    print(i,j)

a a    1
b    2
c    3
d    4
Name: a, dtype: int64
b a    4
b    5
c    6
d    7
Name: b, dtype: int64
c a      asma
b      saba
c      saad
d    umaira
Name: c, dtype: str

In [53]:
df1

   a  b       c
a  1  4    asma
b  2  5    saba
c  3  6    saad
d  4  7  umaira

In [54]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [55]:
[i for i in df1['a']]

[1, 2, 3, 4]

In [56]:
df1

   a  b       c
a  1  4    asma
b  2  5    saba
c  3  6    saad
d  4  7  umaira

#### ***To find sum of all***

In [ ]:
def test(x):
    return x.sum()
df1.apply(test,axis=0)#if wo write axis=1 it start summ row wise in this case it generate error

a                    10
b                    22
c    asmasabasaadumaira
dtype: object

In [60]:
df2=df1[['a','b']]

In [61]:
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [65]:
df2.map(lambda x:x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [66]:
df1

   a  b       c
a  1  4    asma
b  2  5    saba
c  3  6    saad
d  4  7  umaira

In [67]:
df1.sort_values('c')

   a  b       c
a  1  4    asma
c  3  6    saad
b  2  5    saba
d  4  7  umaira

In [69]:
df1.sort_index(ascending= False)

   a  b       c
d  4  7  umaira
c  3  6    saad
b  2  5    saba
a  1  4    asma

#### ***To chk the large data***

In [76]:
pd.set_option("display.max_colwidth",1000)
df3=pd.DataFrame({"desc":["Pandas me jo error aa raha tha uska simple reason yeh hai ke **naye pandas version me `applymap()` remove kar diya gaya hai**, is liye DataFrame ke liye woh method ab exist hi nahi karta. Pehle hum element-wise operation ke liye `applymap()` use karte the, lekin ab uski jagah **`map()`** use hota hai, ya agar data numeric ho to seedha **`df2 ** 2`** likhna sab se best aur fast tareeqa hota hai. Is wajah se `AttributeError` aa raha tha, aur solution yeh hai ke updated method ya vectorized operation use ki jaye.""WHILE LOOP.ipynb"
]})

In [77]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  desc
0  Pandas me jo error aa raha tha uska simple reason yeh hai ke **naye pandas version me `applymap()` remove kar diya gaya hai**, is liye DataFrame ke liye woh method ab exist hi nahi karta. Pehle hum element-wise operation ke liye `applymap()` use karte the, lekin ab uski jagah **`map()`** use hota hai, ya agar data numeric ho to seedha **`df2 ** 2`** likhna sab se best aur fast tareeqa hota hai. Is wajah se `AttributeError` aa raha tha, aur solution yeh hai ke updated method ya vectorized operation use ki jaye.WHILE LOOP.ipynb

In [78]:
pd.set_option("display.max_colwidth",1000)
df3=pd.DataFrame({"desc":["Pandas me jo error aa raha tha uska simple reason yeh hai ke **naye pandas version me `applymap()` remove kar diya gaya hai**, is liye DataFrame ke liye woh method ab exist hi nahi karta. Pehle hum element-wise operation ke liye `applymap()` use karte the, lekin ab uski jagah **`map()`** use hota hai, ya agar data numeric ho to seedha **`df2 ** 2`** likhna sab se best aur fast tareeqa hota hai. Is wajah se `AttributeError` aa raha tha, aur solution yeh hai ke updated method ya vectorized operation use ki jaye.""WHILE LOOP.ipynb","my name is asma","i am a student"
]})

In [79]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  desc
0  Pandas me jo error aa raha tha uska simple reason yeh hai ke **naye pandas version me `applymap()` remove kar diya gaya hai**, is liye DataFrame ke liye woh method ab exist hi nahi karta. Pehle hum element-wise operation ke liye `applymap()` use karte the, lekin ab uski jagah **`map()`** use hota hai, ya agar data numeric ho to seedha **`df2 ** 2`** likhna sab se best aur fast tareeqa hota hai. Is wajah se `AttributeError` aa raha tha, aur solution yeh hai ke updated method ya vectorized operation use ki jaye.WHILE LOOP.ipynb
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      my name is asma
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       i am a student

In [81]:
df3['len']=df3['desc'].apply(len)

In [82]:
df3

,desc,len
0,"Pandas me jo error aa raha tha uska simple reason yeh hai ke **naye pandas version me `applymap()` remove kar diya gaya hai**, is liye DataFrame ke liye woh method ab exist hi nahi karta. Pehle hum element-wise operation ke liye `applymap()` use karte the, lekin ab uski jagah **`map()`** use hota hai, ya agar data numeric ho to seedha **`df2 ** 2`** likhna sab se best aur fast tareeqa hota hai. Is wajah se `AttributeError` aa raha tha, aur solution yeh hai ke updated method ya vectorized operation use ki jaye.WHILE LOOP.ipynb",531
1,my name is asma,15
2,i am a student,14

In [84]:
df3['word_count']=df3['desc'].apply(lambda x:len(x.split()))

In [85]:
df3

,desc,len,word_count
0,"Pandas me jo error aa raha tha uska simple reason yeh hai ke **naye pandas version me `applymap()` remove kar diya gaya hai**, is liye DataFrame ke liye woh method ab exist hi nahi karta. Pehle hum element-wise operation ke liye `applymap()` use karte the, lekin ab uski jagah **`map()`** use hota hai, ya agar data numeric ho to seedha **`df2 ** 2`** likhna sab se best aur fast tareeqa hota hai. Is wajah se `AttributeError` aa raha tha, aur solution yeh hai ke updated method ya vectorized operation use ki jaye.WHILE LOOP.ipynb",531,93
1,my name is asma,15,4
2,i am a student,14,4